syabyr/efr32_base/protocol/z-wave/Apps/WallController/WallController.c
static const SProtocolConfig_t ProtocolConfig = {
  .pVirtualSlaveNodeInfoTable = NULL,
  .pSecureKeysRequested = &SecureKeysRequested,
  .pNodeInfo = &AppNodeInfo,
  .pRadioConfig = &RadioConfig
};

/**
 * Setup AGI lifeline table from config_app.h
 */
//@ [wall_controller_agi_root_device_lifeline]
CMD_CLASS_GRP agiTableLifeLine[] = {AGITABLE_LIFELINE_GROUP};
//@ [wall_controller_agi_root_device_lifeline]

/**
 * @var agiTableRootDeviceGroups
 * AGI table defining the groups for root device.
 */
//@ [wall_controller_agi_other_groups]
AGI_GROUP agiTableRootDeviceGroups[] = {AGITABLE_ROOTDEVICE_GROUPS};
//@ [wall_controller_agi_other_groups]

/*
 * Validate that MAX_ASSOCIATION_GROUPS (defined in config_app.h) match the
 * number of elements in AGITABLE_ROOTDEVICE_GROUPS (also defined in
 * config_app.h) plus one (for Lifeline)
 */
STATIC_ASSERT((sizeof_array(agiTableRootDeviceGroups) + 1) == MAX_ASSOCIATION_GROUPS, MAX_ASSOCIATION_GROUPS_value_is_invalid);

/**************************************************************************************************
 * Configuration for Z-Wave Plus Info CC
 **************************************************************************************************
 */
static const SCCZWavePlusInfo CCZWavePlusInfo = {
                               .pEndpointIconList = NULL,
                               .roleType = APP_ROLE_TYPE,
                               .nodeType = APP_NODE_TYPE,
                               .installerIconType = APP_ICON_TYPE,
                               .userIconType = APP_USER_ICON_TYPE
};

/**
 * Application state-machine state.
 */
static STATE_APP currentState;

/**
 * Parameter is used to save wakeup reason after ApplicationInit(..)
 */
EResetReason_t g_eResetReason;

typedef struct _NEXT_JOB_Q_
{
  agi_profile_t profile;
} NEXT_JOB_Q;

/**
 * Holds the latest button action.
 * The action is used to distinguish between which action to perform:
 * - Press    => Switch on/off
 * - Hold     => Start dimming
 * - Release  => Stop dimming
 */
static key_event_t keyEventGlobal;
static uint8_t centralSceneNumberHold;
static uint8_t centralSceneKeyAttributeHold;

static ESwTimerStatus centralSceneHoldTimerStatus = ESWTIMER_STATUS_FAILED;
// Timer
static SSwTimer CentralSceneHoldTimer;

static CCMLS_PRIMARY_SWITCH_T multiLevelDirection[NUMBER_OF_KEYS] = {CCMLS_PRIMARY_SWITCH_DOWN, CCMLS_PRIMARY_SWITCH_DOWN, CCMLS_PRIMARY_SWITCH_DOWN};
static uint8_t buttonStates[NUMBER_OF_KEYS] = {0, 0, 0};
static key_id_t m_button;
NEXT_JOB_Q nextJob;

static TaskHandle_t g_AppTaskHandle;

#ifdef DEBUGPRINT
static uint8_t m_aDebugPrintBuffer[96];
#endif

// Pointer to AppHandles that is passed as input to ApplicationTask(..)
SApplicationHandles* g_pAppHandles;

// Prioritized events that can wakeup protocol thread.
typedef enum EApplicationEvent
{
  EAPPLICATIONEVENT_TIMER = 0,
  EAPPLICATIONEVENT_ZWRX,
  EAPPLICATIONEVENT_ZWCOMMANDSTATUS,
  EAPPLICATIONEVENT_APP
} EApplicationEvent;

static void EventHandlerZwRx(void);
static void EventHandlerZwCommandStatus(void);
static void EventHandlerApp(void);

// Event distributor object
static SEventDistributor g_EventDistributor;

// Event distributor event handler table
static const EventDistributorEventHandler g_aEventHandlerTable[4] =
{
  AppTimerNotificationHandler,  // Event 0
  EventHandlerZwRx,
  EventHandlerZwCommandStatus,
  EventHandlerApp
};

// Used by the application data file.
typedef struct SApplicationData
{
  uint8_t slowRefresh;
} SApplicationData;

#define FILE_SIZE_APPLICATIONDATA     (sizeof(SApplicationData))

static SApplicationData ApplicationData;

#define APP_EVENT_QUEUE_SIZE 5

/**
 * The following four variables are used for the application event queue.
 */
static SQueueNotifying m_AppEventNotifyingQueue;
static StaticQueue_t m_AppEventQueueObject;
static EVENT_APP eventQueueStorage[APP_EVENT_QUEUE_SIZE];
static QueueHandle_t m_AppEventQueue;

/* True Status Engine (TSE) variables */
static s_CC_indicator_data_t ZAF_TSE_localActuationIdentifyData = {
  .rxOptions = {
    .rxStatus = 0,          /* rxStatus, verified by the TSE for Multicast */
    .securityKey = 0,       /* securityKey, ignored by the TSE */
    .sourceNode = {0,0},    /* sourceNode (nodeId, endpoint), verified against lifeline destinations by the TSE */
    .destNode = {0,0}       /* destNode (nodeId, endpoint), verified by the TSE for local endpoint */
  },
  .indicatorId = 0x50      /* Identify Indicator*/
};

static nvm3_Handle_t* pFileSystemApplication;

static EVENT_APP pendingKeyPressEvent = EVENT_APP_CC_NO_JOB;

/****************************************************************************/
/*                              EXPORTED DATA                               */
/****************************************************************************/

// No exported data.

/****************************************************************************/
/* PRIVATE FUNCTION PROTOTYPES                                              */
/****************************************************************************/

void DeviceResetLocallyDone(TRANSMISSION_RESULT * pTransmissionResult);
void DeviceResetLocally(void);
STATE_APP GetAppState(void);
void AppStateManager(EVENT_APP event);
static void ChangeState(STATE_APP newState);

static void ApplicationTask(SApplicationHandles* pAppHandles);
static void LearnCompleted(void);

static void PrepareAGITransmission(uint8_t profile, key_id_t nextActiveButton);
static JOB_STATUS InitiateTransmission(void);
void ZCB_TransmitCallback(TRANSMISSION_RESULT * pTransmissionResult);
static void InitiateCentralSceneTX(uint8_t keyAttribute, uint8_t sceneNumber);
static void ZCB_CentralSceneHoldTimerCallback(SSwTimer *pTimer);
bool LoadConfiguration(void);
void SetDefaultConfiguration(void);

SApplicationData readAppData(void);
void writeAppData(const SApplicationData* pAppData);

void AppResetNvm(void);

/**
* @brief Called when protocol puts a frame on the ZwRxQueue.
*/
static void EventHandlerZwRx(void)
{
  QueueHandle_t Queue = g_pAppHandles->ZwRxQueue;
  SZwaveReceivePackage RxPackage;

