syabyr/efr32_base/protocol/z-wave/Apps/WallController/WallController.c
        /*
         * Initialize AGI.
         */
        //@ [WALL_CONTROLLER_AGI_INIT]
        AGI_Init();

        CC_AGI_LifeLineGroupSetup(agiTableLifeLine, sizeof_array(agiTableLifeLine), ENDPOINT_ROOT);
        AGI_ResourceGroupSetup(agiTableRootDeviceGroups, sizeof_array(agiTableRootDeviceGroups), ENDPOINT_ROOT);
        //@ [WALL_CONTROLLER_AGI_INIT]

        /*
         * Initialize Event Scheduler.
         */
        Transport_OnApplicationInitSW( &m_AppNIF, NULL);

        /* Enter SmartStart*/
        /* Protocol will commence SmartStart only if the node is NOT already included in the network */
        ZAF_setNetworkLearnMode(E_NETWORK_LEARN_MODE_INCLUSION_SMARTSTART, g_eResetReason);

        /* Init state machine*/
        ZAF_EventHelperEventEnqueue(EVENT_EMPTY);

        break;
      }
      CC_FirmwareUpdate_Init(NULL, NULL, NULL, true);
      ChangeState(STATE_APP_IDLE);
      break;

    case STATE_APP_IDLE:
      if(EVENT_APP_REFRESH_MMI == event)
      {
        Board_IndicateStatus(BOARD_STATUS_IDLE);
        break;
      }

      if(EVENT_APP_FLUSHMEM_READY == event)
      {
        AppResetNvm();
        LoadConfiguration();
      }

      if(EVENT_APP_SMARTSTART_IN_PROGRESS == event)
      {
        ChangeState(STATE_APP_LEARN_MODE);
      }

      /**************************************************************************************
       * Learn/Reset button
       **************************************************************************************
       */
      if ((BTN_EVENT_SHORT_PRESS(APP_BUTTON_LEARN_RESET) == (BUTTON_EVENT)event) ||
          (EVENT_SYSTEM_LEARNMODE_START == (EVENT_SYSTEM)event))
      {
        if (EINCLUSIONSTATE_EXCLUDED != g_pAppHandles->pNetworkInfo->eInclusionState)
        {
          DPRINT("LEARN_MODE_EXCLUSION");
          ZAF_setNetworkLearnMode(E_NETWORK_LEARN_MODE_EXCLUSION_NWE, g_eResetReason);
        }
        else{
          DPRINT("LEARN_MODE_INCLUSION");
          ZAF_setNetworkLearnMode(E_NETWORK_LEARN_MODE_INCLUSION, g_eResetReason);
        }
        ChangeState(STATE_APP_LEARN_MODE);
        break;
      }

      /**************************************************************************************
       * KEY 1
       **************************************************************************************
       */
      if (BTN_EVENT_SHORT_PRESS(KEY01_BTN) == (BUTTON_EVENT)event)
      {
        DPRINT("\r\nK1SHORT_PRESS\r\n");
        keyEventGlobal = KEY_EVENT_SHORT_PRESS;
        centralSceneNumberHold = 1;
        centralSceneKeyAttributeHold = CENTRAL_SCENE_NOTIFICATION_KEY_ATTRIBUTES_KEY_PRESSED_1_TIME_V2;

        //ZAF_jobEnqueue(EVENT_APP_CENTRAL_SCENE_JOB);
        ZAF_JobHelperJobEnqueue(EVENT_APP_CENTRAL_SCENE_JOB);

        PrepareAGITransmission(ASSOCIATION_GROUP_INFO_REPORT_PROFILE_CONTROL_KEY01, KEY01);
        ZAF_EventHelperEventEnqueue(EVENT_APP_NEXT_EVENT_JOB);
        ChangeState(STATE_APP_TRANSMIT_DATA);
      }

      if (BTN_EVENT_HOLD(KEY01_BTN) == (BUTTON_EVENT)event)
      {
        DPRINT("\r\nK1HOLD\r\n");
        keyEventGlobal = KEY_EVENT_HOLD;
        centralSceneNumberHold = 1;
        centralSceneKeyAttributeHold = CENTRAL_SCENE_NOTIFICATION_KEY_ATTRIBUTES_KEY_HELD_DOWN_V2;

        ZAF_JobHelperJobEnqueue(EVENT_APP_CENTRAL_SCENE_JOB);

        PrepareAGITransmission(ASSOCIATION_GROUP_INFO_REPORT_PROFILE_CONTROL_KEY01, KEY01);
        ZAF_EventHelperEventEnqueue(EVENT_APP_NEXT_EVENT_JOB);
        ChangeState(STATE_APP_TRANSMIT_DATA);
      }

      if ( ((BTN_EVENT_UP(KEY01_BTN) == (BUTTON_EVENT)event) || (BTN_EVENT_LONG_PRESS(KEY01_BTN) == (BUTTON_EVENT)event)) &&
           (keyEventGlobal == KEY_EVENT_HOLD) )
      {
        DPRINT("\r\nK1UP\r\n");
        keyEventGlobal = KEY_EVENT_UP;
        centralSceneNumberHold = 1;
        centralSceneKeyAttributeHold = CENTRAL_SCENE_NOTIFICATION_KEY_ATTRIBUTES_KEY_RELEASED_V2;

        ZAF_JobHelperJobEnqueue(EVENT_APP_CENTRAL_SCENE_JOB);

        PrepareAGITransmission(ASSOCIATION_GROUP_INFO_REPORT_PROFILE_CONTROL_KEY01, KEY01);
        ZAF_EventHelperEventEnqueue(EVENT_APP_NEXT_EVENT_JOB);
        ChangeState(STATE_APP_TRANSMIT_DATA);
      }

      /**************************************************************************************
       * KEY 2
       **************************************************************************************
       */
      if (BTN_EVENT_SHORT_PRESS(KEY02_BTN) == (BUTTON_EVENT)event)
      {
        DPRINT("\r\nK2SHORT_PRESS\r\n");
        keyEventGlobal = KEY_EVENT_SHORT_PRESS;
        centralSceneNumberHold = 2;
        centralSceneKeyAttributeHold = CENTRAL_SCENE_NOTIFICATION_KEY_ATTRIBUTES_KEY_PRESSED_1_TIME_V2;

        ZAF_JobHelperJobEnqueue(EVENT_APP_CENTRAL_SCENE_JOB);

        PrepareAGITransmission(ASSOCIATION_GROUP_INFO_REPORT_PROFILE_CONTROL_KEY02, KEY02);
        ZAF_EventHelperEventEnqueue(EVENT_APP_NEXT_EVENT_JOB);
        ChangeState(STATE_APP_TRANSMIT_DATA);
      }

      if (BTN_EVENT_HOLD(KEY02_BTN) == (BUTTON_EVENT)event)
      {
        DPRINT("\r\nK2HOLD\r\n");
        keyEventGlobal = KEY_EVENT_HOLD;
        centralSceneNumberHold = 2;
        centralSceneKeyAttributeHold = CENTRAL_SCENE_NOTIFICATION_KEY_ATTRIBUTES_KEY_HELD_DOWN_V2;

        ZAF_JobHelperJobEnqueue(EVENT_APP_CENTRAL_SCENE_JOB);

        PrepareAGITransmission(ASSOCIATION_GROUP_INFO_REPORT_PROFILE_CONTROL_KEY02, KEY02);
        ZAF_EventHelperEventEnqueue(EVENT_APP_NEXT_EVENT_JOB);
        ChangeState(STATE_APP_TRANSMIT_DATA);
      }

      if ( ((BTN_EVENT_UP(KEY02_BTN) == (BUTTON_EVENT)event) || (BTN_EVENT_LONG_PRESS(KEY02_BTN) == (BUTTON_EVENT)event)) &&
           (keyEventGlobal == KEY_EVENT_HOLD) )
      {
        DPRINT("\r\nK2UP\r\n");
        keyEventGlobal = KEY_EVENT_UP;
        centralSceneNumberHold = 2;
        centralSceneKeyAttributeHold = CENTRAL_SCENE_NOTIFICATION_KEY_ATTRIBUTES_KEY_RELEASED_V2;

        ZAF_JobHelperJobEnqueue(EVENT_APP_CENTRAL_SCENE_JOB);

        PrepareAGITransmission(ASSOCIATION_GROUP_INFO_REPORT_PROFILE_CONTROL_KEY02, KEY02);
        ZAF_EventHelperEventEnqueue(EVENT_APP_NEXT_EVENT_JOB);
        ChangeState(STATE_APP_TRANSMIT_DATA);
      }

      /**************************************************************************************
       * KEY 3
       **************************************************************************************
       */
      if (BTN_EVENT_SHORT_PRESS(KEY03_BTN) == (BUTTON_EVENT)event)
      {
        DPRINT("\r\nK3SHORT_PRESS\r\n");
        keyEventGlobal = KEY_EVENT_SHORT_PRESS;
        centralSceneNumberHold = 3;
        centralSceneKeyAttributeHold = CENTRAL_SCENE_NOTIFICATION_KEY_ATTRIBUTES_KEY_PRESSED_1_TIME_V2;

        ZAF_JobHelperJobEnqueue(EVENT_APP_CENTRAL_SCENE_JOB);

        PrepareAGITransmission(ASSOCIATION_GROUP_INFO_REPORT_PROFILE_CONTROL_KEY03, KEY03);
        ZAF_EventHelperEventEnqueue(EVENT_APP_NEXT_EVENT_JOB);
        ChangeState(STATE_APP_TRANSMIT_DATA);
      }

      if (BTN_EVENT_HOLD(KEY03_BTN) == (BUTTON_EVENT)event)
      {
        DPRINT("\r\nK3HOLD\r\n");
        keyEventGlobal = KEY_EVENT_HOLD;
        centralSceneNumberHold = 3;
        centralSceneKeyAttributeHold = CENTRAL_SCENE_NOTIFICATION_KEY_ATTRIBUTES_KEY_HELD_DOWN_V2;

        ZAF_JobHelperJobEnqueue(EVENT_APP_CENTRAL_SCENE_JOB);

        PrepareAGITransmission(ASSOCIATION_GROUP_INFO_REPORT_PROFILE_CONTROL_KEY03, KEY03);
        ZAF_EventHelperEventEnqueue(EVENT_APP_NEXT_EVENT_JOB);
        ChangeState(STATE_APP_TRANSMIT_DATA);
      }

      if ( ((BTN_EVENT_UP(KEY03_BTN) == (BUTTON_EVENT)event) || (BTN_EVENT_LONG_PRESS(KEY03_BTN) == (BUTTON_EVENT)event)) &&
           (keyEventGlobal == KEY_EVENT_HOLD) )
      {
        DPRINT("\r\nK3UP\r\n");
        keyEventGlobal = KEY_EVENT_UP;
        centralSceneNumberHold = 3;
        centralSceneKeyAttributeHold = CENTRAL_SCENE_NOTIFICATION_KEY_ATTRIBUTES_KEY_RELEASED_V2;

        ZAF_JobHelperJobEnqueue(EVENT_APP_CENTRAL_SCENE_JOB);

        PrepareAGITransmission(ASSOCIATION_GROUP_INFO_REPORT_PROFILE_CONTROL_KEY03, KEY03);
        ZAF_EventHelperEventEnqueue(EVENT_APP_NEXT_EVENT_JOB);
        ChangeState(STATE_APP_TRANSMIT_DATA);
      }
      break;


    case STATE_APP_LEARN_MODE:
      if(EVENT_APP_REFRESH_MMI == event)
      {
        Board_IndicateStatus(BOARD_STATUS_LEARNMODE_ACTIVE);
      }

      if(EVENT_APP_FLUSHMEM_READY == event)
      {
        AppResetNvm();
        LoadConfiguration();
      }

      if ((BTN_EVENT_SHORT_PRESS(APP_BUTTON_LEARN_RESET) == (BUTTON_EVENT)event) ||
          (EVENT_SYSTEM_LEARNMODE_STOP == (EVENT_SYSTEM)event))
      {
        DPRINT("\r\nLEARN MODE DISABLE\r\n");
        ZAF_setNetworkLearnMode(E_NETWORK_LEARN_MODE_DISABLE, g_eResetReason);

