syabyr/efr32_base/protocol/z-wave/Apps/WallController/WallController.c
        //Go back to smart start if the node was never included.
        //Protocol will not commence SmartStart if the node is already included in the network.
        ZAF_setNetworkLearnMode(E_NETWORK_LEARN_MODE_INCLUSION_SMARTSTART, g_eResetReason);

        Board_IndicateStatus(BOARD_STATUS_IDLE);
        ChangeState(STATE_APP_IDLE);

        /* If we are in a network and the Identify LED state was changed to idle due to learn mode, report it to lifeline */
        CC_Indicator_RefreshIndicatorProperties();
        ZAF_TSE_Trigger((void *)CC_Indicator_report_stx, &ZAF_TSE_localActuationIdentifyData, true);
      }

      if(EVENT_SYSTEM_LEARNMODE_FINISHED == (EVENT_SYSTEM)event)
      {
        //Go back to smart start if the node was excluded.
        //Protocol will not commence SmartStart if the node is already included in the network.
        ZAF_setNetworkLearnMode(E_NETWORK_LEARN_MODE_INCLUSION_SMARTSTART, g_eResetReason);

        DPRINT("\r\nLEARN MODE FINISH\r\n");
        ChangeState(STATE_APP_IDLE);

        /* If we are in a network and the Identify LED state was changed to idle due to learn mode, report it to lifeline */
        CC_Indicator_RefreshIndicatorProperties();
        ZAF_TSE_Trigger((void *)CC_Indicator_report_stx, &ZAF_TSE_localActuationIdentifyData, true);
      }
      break;

    case STATE_APP_RESET:
      if(EVENT_APP_REFRESH_MMI == event){}

      if(EVENT_APP_FLUSHMEM_READY == event)
      {
        AppResetNvm();
        /* Soft reset */
        Board_ResetHandler();
      }

      break;

    case STATE_APP_TRANSMIT_DATA:
      if(EVENT_APP_REFRESH_MMI == event)
      {
        // Nothing here.
      }

      if(EVENT_APP_FLUSHMEM_READY == event)
      {
        AppResetNvm();
        LoadConfiguration();
      }

      if (EVENT_APP_NEXT_EVENT_JOB == event)
      {
        uint8_t event;
        if (true == ZAF_JobHelperJobDequeue(&event))
        {
          /*
           * If we were able to dequeue an event from the job queue, let's process it right away
           * by adding it to the event queue.
           */
          ZAF_EventHelperEventEnqueue(event);
        }
        else
        {
          // If there are no more events, we'll finish the job handling.
          ZAF_EventHelperEventEnqueue(EVENT_APP_FINISH_EVENT_JOB);
        }
      }

      if (EVENT_APP_CENTRAL_SCENE_JOB == event)
      {
        if (KEY_EVENT_HOLD == keyEventGlobal)
        {
          if (ESWTIMER_STATUS_FAILED == centralSceneHoldTimerStatus)
          {
            // Start the timer only if it's not started already.
            centralSceneHoldTimerStatus = TimerStart(&CentralSceneHoldTimer, ( 0 == ApplicationData.slowRefresh ) ? 200 : 55000);
          }
        }
        else if (KEY_EVENT_UP == keyEventGlobal)
        {
          if (ESWTIMER_STATUS_FAILED != centralSceneHoldTimerStatus)
          {
            TimerStop(&CentralSceneHoldTimer);
            centralSceneHoldTimerStatus = ESWTIMER_STATUS_FAILED;
          }
        }

        InitiateCentralSceneTX(
          centralSceneKeyAttributeHold,
          centralSceneNumberHold);
      }

      if (EVENT_APP_CC_BASIC_JOB == event)
      {
        DPRINT("\r\nEVENT_APP_CC_BASIC_JOB");
        if(JOB_STATUS_SUCCESS != CC_Basic_Set_tx( &nextJob.profile, ENDPOINT_ROOT, buttonStates[m_button],ZCB_TransmitCallback))
        {
          DPRINT("\r\nEVENT_APP_CC_BASIC_JOB failed!\r\n");
          ZAF_EventHelperEventEnqueue(EVENT_APP_NEXT_EVENT_JOB);
        }
      }

      if(EVENT_APP_CC_SWITCH_MULTILEVEL_JOB == event)
      {
        JOB_STATUS jobStatus = InitiateTransmission();
        DPRINT("\r\nEVENT_APP_CC_SWITCH_MULTILEVEL_JOB");
        if (JOB_STATUS_SUCCESS != jobStatus)
        {
          TRANSMISSION_RESULT transmissionResult = {0, 0, TRANSMISSION_RESULT_FINISHED};
          DPRINT("\r\nCC_SWITCH_MULTILEVEL ERROR");
          ZCB_TransmitCallback(&transmissionResult);
        }
      }

      /*
       * Catch important button press/release events and save it for when the transmit is done.
       * Important events are "Key Up" and "Key Long Press", which both are button release events
       * and signify the end to an action that was initiated earlier and therefore must be matched.
       */
      if ( ((BTN_EVENT_UP(KEY01_BTN) == (BUTTON_EVENT)event) || (BTN_EVENT_LONG_PRESS(KEY01_BTN) == (BUTTON_EVENT)event)) ||
           ((BTN_EVENT_UP(KEY02_BTN) == (BUTTON_EVENT)event) || (BTN_EVENT_LONG_PRESS(KEY02_BTN) == (BUTTON_EVENT)event)) ||
           ((BTN_EVENT_UP(KEY03_BTN) == (BUTTON_EVENT)event) || (BTN_EVENT_LONG_PRESS(KEY03_BTN) == (BUTTON_EVENT)event)) )
      {
        DPRINTF("\r\nReceived key press event (%d) in state STATE_APP_TRANSMIT_DATA", event);
        pendingKeyPressEvent = event;
      }

      if (EVENT_APP_FINISH_EVENT_JOB == event)
      {
        DPRINT("\r\nTransmitDone.");
        if (EVENT_APP_CC_NO_JOB != pendingKeyPressEvent)
        {
          // Button press/release event received earlier during transmit. Re-post it to the event queue now.
          DPRINTF("\r\nRe-posting pending key event (%d) in state STATE_APP_TRANSMIT_DATA)", pendingKeyPressEvent);
          ZAF_EventHelperEventEnqueue(pendingKeyPressEvent);
          pendingKeyPressEvent = EVENT_APP_CC_NO_JOB;
        }
        ChangeState(STATE_APP_IDLE);
      }
      break;

    default:
      // Do nothing.
      break;
  }
}

/**
 * @brief Sets the current state to a new, given state.
 * @param newState New state.
 */
static void
ChangeState(STATE_APP newState)
{
  DPRINTF("\r\nState changed: %d -> %d\r\n", currentState, newState);

  currentState = newState;

  /**< Pre-action on new state is to refresh MMI */
  ZAF_EventHelperEventEnqueue(EVENT_APP_REFRESH_MMI);
}

/**
 * @brief Transmission callback for Device Reset Locally call.
 * @param pTransmissionResult Result of each transmission.
 */
void
DeviceResetLocallyDone(TRANSMISSION_RESULT * pTransmissionResult)
{
  if (TRANSMISSION_RESULT_FINISHED == pTransmissionResult->isFinished)
  {
    /* Reset protocol */
    // Set default command to protocol
    SZwaveCommandPackage CommandPackage;
    CommandPackage.eCommandType = EZWAVECOMMANDTYPE_SET_DEFAULT;

    DPRINT("\nDisabling watchdog during reset\n");
    WDOGn_Enable(DEFAULT_WDOG, false);

    EQueueNotifyingStatus Status = QueueNotifyingSendToBack(g_pAppHandles->pZwCommandQueue, (uint8_t*)&CommandPackage, 500);
    ASSERT(EQUEUENOTIFYING_STATUS_SUCCESS == Status);
  }
}

/**
 * @brief Send reset notification.
 */
void
DeviceResetLocally(void)
{
  agi_profile_t lifelineProfile = {
      ASSOCIATION_GROUP_INFO_REPORT_PROFILE_GENERAL,
      ASSOCIATION_GROUP_INFO_REPORT_PROFILE_GENERAL_LIFELINE
  };
  DPRINT("\r\nCall locally reset");

  CC_DeviceResetLocally_notification_tx(&lifelineProfile, DeviceResetLocallyDone);
}

/**
 * @brief See description for function prototype in CC_Version.h.
 */
uint8_t
CC_Version_getNumberOfFirmwareTargets_handler(void)
{
  return 1; /*CHANGE THIS - firmware 0 version*/
}


/**
 * @brief See description for function prototype in CC_Version.h.
 */
void
handleGetFirmwareVersion(
  uint8_t bFirmwareNumber,
  VG_VERSION_REPORT_V2_VG *pVariantgroup)
{
  /*firmware 0 version and sub version*/
  if(bFirmwareNumber == 0)
  {
    pVariantgroup->firmwareVersion = ZAF_GetAppVersionMajor();
    pVariantgroup->firmwareSubVersion = ZAF_GetAppVersionMinor();
  }
  else
  {
    /*Just set it to 0 if firmware n is not present*/
    pVariantgroup->firmwareVersion = 0;
    pVariantgroup->firmwareSubVersion = 0;
  }
}


/**
 * @brief Function resets configuration to default values.
 */
void
SetDefaultConfiguration(void)
{
  AssociationInit(true, pFileSystemApplication);

