syabyr/efr32_base/protocol/z-wave/Apps/WallController/WallController.c
  ApplicationData.slowRefresh = 1;

  writeAppData(&ApplicationData);

  uint32_t appVersion = ZAF_GetAppVersion();
  nvm3_writeData(pFileSystemApplication, ZAF_FILE_ID_APP_VERSION, &appVersion, ZAF_FILE_SIZE_APP_VERSION);
}

/**
 * @brief This function loads the application settings from file system.
 * If no settings are found, default values are used and saved.
 */
bool
LoadConfiguration(void)
{
  // Init file system
  ApplicationFileSystemInit(&pFileSystemApplication);


  uint32_t appVersion;
  Ecode_t versionFileStatus = nvm3_readData(pFileSystemApplication, ZAF_FILE_ID_APP_VERSION, &appVersion, ZAF_FILE_SIZE_APP_VERSION);

  if (ECODE_NVM3_OK == versionFileStatus)
  {
    if (ZAF_GetAppVersion() != appVersion)
    {
      // Add code for migration of file system to higher version here.
    }

    ApplicationData = readAppData();

    /* Initialize association module */
    AssociationInit(false, pFileSystemApplication);

    return true;
  }
  else
  {
    DPRINT("Application FileSystem Verify failed\r\n");
    loadInitStatusPowerLevel();

    // Reset the file system if ZAF_FILE_ID_APP_VERSION is missing since this indicates
    // corrupt or missing file system.
    AppResetNvm();

    return false;
  }

}

void AppResetNvm(void)
{
  DPRINT("Resetting application FileSystem to default\r\n");

  ASSERT(0 != pFileSystemApplication); //Assert has been kept for debugging , can be removed from production code. This error can only be caused by some internal flash HW failure

  Ecode_t errCode = nvm3_eraseAll(pFileSystemApplication);
  ASSERT(ECODE_NVM3_OK == errCode);  //Assert has been kept for debugging , can be removed from production code. This error can only be caused by some internal flash HW failure

  /* Initialize transport layer */
  Transport_SetDefault();

  /* Apparently there is no valid configuration in file system, so load */
  /* default values and save them to file system. */
  SetDefaultConfiguration();
}

/**
 * @brief Prepares the transmission of commands stored in the AGI table.
 *
 * @param profile The profile key.
 * @param srcEndpoint The source endpoint.
 */
static void
PrepareAGITransmission(
        uint8_t profile,
        key_id_t nextActiveButton)
{
  DPRINTF("\r\nPrepareAGITransmission %d", keyEventGlobal);

  nextJob.profile.profile_MS = ASSOCIATION_GROUP_INFO_REPORT_PROFILE_CONTROL;
  nextJob.profile.profile_LS = profile;

  m_button = nextActiveButton;
  if (KEY_EVENT_SHORT_PRESS == keyEventGlobal)
  {
    ZAF_JobHelperJobEnqueue(EVENT_APP_CC_BASIC_JOB);
    if (0xFF == buttonStates[m_button])
    {
      /*
       * If button is on, turn device off.
       */
      buttonStates[m_button] = 0x00;
      DPRINT("\r\nBasic OFF");
    }
    else
    {
      /*
       * If button is off, turn device on.
       */
      buttonStates[m_button] = 0xFF;
      DPRINT("\r\nBasic ON");
    }
  }
  else if (KEY_EVENT_HOLD == keyEventGlobal)
  {
    DPRINT("\r\npre EVENT_APP_CC_SWITCH_MULTILEVEL_JOB");
    ZAF_JobHelperJobEnqueue(EVENT_APP_CC_SWITCH_MULTILEVEL_JOB);
    if (CCMLS_PRIMARY_SWITCH_UP == multiLevelDirection[m_button])
    {
      multiLevelDirection[m_button] = CCMLS_PRIMARY_SWITCH_DOWN;
    }
    else
    {
      multiLevelDirection[m_button] = CCMLS_PRIMARY_SWITCH_UP;
    }
  }
  else if (KEY_EVENT_UP == keyEventGlobal)
  {
    DPRINT("\r\npre BUTTON_UP EVENT_APP_CC_SWITCH_MULTILEVEL_JOB");
    ZAF_JobHelperJobEnqueue(EVENT_APP_CC_SWITCH_MULTILEVEL_JOB);
  }
}

/**
 * Initiates a Central Scene Notification to the lifeline.
 * We don't care about the result, since we have to proceed no matter what.
 * Therefore a callback function is called in any case.
 * @param keyAttribute The key attribute in action.
 * @param sceneNumber The scene in action.
 */
static void InitiateCentralSceneTX(uint8_t keyAttribute, uint8_t sceneNumber)
{
  agi_profile_t lifelineProfile = {
      ASSOCIATION_GROUP_INFO_REPORT_PROFILE_GENERAL_NA_V2,
      ASSOCIATION_GROUP_INFO_REPORT_PROFILE_GENERAL_LIFELINE
  };

  JOB_STATUS jobStatus = CommandClassCentralSceneNotificationTransmit(
          &lifelineProfile,
          ENDPOINT_ROOT,
          keyAttribute,
          sceneNumber,
          ZCB_TransmitCallback);

  if (JOB_STATUS_SUCCESS != jobStatus)
  {
    TRANSMISSION_RESULT transmissionResult;
    transmissionResult.nodeId = 0;
    transmissionResult.status = TRANSMIT_COMPLETE_FAIL;
    transmissionResult.isFinished = TRANSMISSION_RESULT_FINISHED;
    DPRINT("\r\nLL failure");
    ZCB_TransmitCallback(&transmissionResult);
  }
  else
  {
	DPRINT("\r\nLL success");
  }
}


/**
 * @brief Processes the transmission to related nodes.
 * @return Status of the job.
 */
static JOB_STATUS
InitiateTransmission(void)
{
  DPRINTF("\r\n### ITrans %d", keyEventGlobal);
  if (KEY_EVENT_HOLD == keyEventGlobal)
  {
    DPRINT("\r\n### Multilevel TX.Change");

    return CmdClassMultilevelSwitchStartLevelChange(
                &nextJob.profile,
                ENDPOINT_ROOT,
                ZCB_TransmitCallback,
                multiLevelDirection[m_button],
                CCMLS_IGNORE_START_LEVEL_TRUE,
                CCMLS_SECONDARY_SWITCH_NO_INC_DEC,
                0,
                2,
                0);
  }
  else if (KEY_EVENT_UP == keyEventGlobal)
  {
    DPRINT("\r\n### Multilevel Stop level change");
    return CmdClassMultilevelSwitchStopLevelChange(
                &nextJob.profile,
                ENDPOINT_ROOT,
                ZCB_TransmitCallback);
  }
  return JOB_STATUS_BUSY;
}

/**
 * @brief Callback function setting the application state.
 * @details Sets the application state when done transmitting.
 * @param pTransmissionResult Result of each transmission.
 */
void
ZCB_TransmitCallback(TRANSMISSION_RESULT * pTransmissionResult)
{
  DPRINTF("\r\nTX CB for N %d: %d", pTransmissionResult->nodeId, pTransmissionResult->status);

  if (TRANSMISSION_RESULT_FINISHED == pTransmissionResult->isFinished)
  {
    ZAF_EventHelperEventEnqueue(EVENT_APP_NEXT_EVENT_JOB);
  }
}

/**
 * @brief See description for function prototype in CC_CentralScene.h.
 */
uint8_t getAppCentralSceneReportData(ZW_CENTRAL_SCENE_SUPPORTED_REPORT_1BYTE_V3_FRAME * pData)
{
  pData->supportedScenes = 3; // Number of buttons
  pData->properties1 = (1 << 1) | 1; // 1 bit mask byte & All keys are identical.
  pData->variantgroup1.supportedKeyAttributesForScene1 = 0x07; // 0b00000111.
  return 1;
}

/**
 * @brief See description for function prototype in CC_CentralScene.h.
 */
void getAppCentralSceneConfiguration(central_scene_configuration_t * pConfiguration)
{
  pConfiguration->slowRefresh = readAppData().slowRefresh;
}

/**
 * @brief See description for function prototype in CC_CentralScene.h.
 */
e_cmd_handler_return_code_t
setAppCentralSceneConfiguration(central_scene_configuration_t * pConfiguration)
{
  ApplicationData.slowRefresh = pConfiguration->slowRefresh;
  writeAppData(&ApplicationData);

